In [1]:
import pandas as pd

### 1. Write a python program to convert list to series.

In [3]:
datalist = [10,20,30,40,50]
dataSeries = pd.Series(datalist)
dataSeries

0    10
1    20
2    30
3    40
4    50
dtype: int64

### 2. Write a python program to generate series of dates from first august 2024 to 15 august 2024 (including 1 and 15).

In [6]:
start_date = '2024-08-01'
end_date = '2024-08-15'

dates = pd.date_range(start_date, end_date)
dates

DatetimeIndex(['2024-08-01', '2024-08-02', '2024-08-03', '2024-08-04',
               '2024-08-05', '2024-08-06', '2024-08-07', '2024-08-08',
               '2024-08-09', '2024-08-10', '2024-08-11', '2024-08-12',
               '2024-08-13', '2024-08-14', '2024-08-15'],
              dtype='datetime64[ns]', freq='D')

### 3. Convert a dict to dataframe and display it.

In [8]:
datas = {
    "Names" : ['John','Jacob','Shaheen'],
    "Age" : [23,33,28],
    "Education" : ["BCA","B.com","BSc CS"]
}

details = pd.DataFrame(datas)
details

     Names  Age Education
0     John   23       BCA
1    Jacob   33     B.com
2  Shaheen   28    BSc CS

### 4. Create a 2D list and convert it into DF and display it.

In [14]:
data = [
    ['John',23,'BCA'],
    ['Jacob',33,'B.Com'],
    ['Shaheen',28,'BSc CS']
]

title = ['Name', 'Age', 'Course']

student = pd.DataFrame(data, columns=title)
student

      Name  Age  Course
0     John   23     BCA
1    Jacob   33   B.Com
2  Shaheen   28  BSc CS

### 5. Given a CSV file, read it into a DataFrame and display it

In [19]:
data = pd.read_csv('file.csv')
data

   0  ABC  20
0  1  DEF  30
1  2  GHI  40
2  3  JKL  50

### 6. Given a dataframe sort it by multiple columns

In [35]:
datas = {
    "Names" : ['John','Jacob','Shaheen'],
    "Age" : [23,33,28],
    "Education" : ["BCA","B.com","BSc CS"]
}

students = pd.DataFrame(datas)

details = students.sort_values(by=['Age','Names'])
details

     Names  Age Education
0     John   23       BCA
2  Shaheen   28    BSc CS
1    Jacob   33     B.com

### 7. Given a dataframe with custom indexing, convert and it to default indexing and display it